In [1]:
import acquisition
import numpy as np
import pandas as pd

In [2]:
acq = acquisition.Acquisition()
df_users = acq.get_users()
df_users.grav.replace(inplace=True, value=5, to_replace=1) #to have the value in order cause unscathered was after death
df_users.grav = df_users.grav.sub(1) # to be more human-friendly

C:\Users\clemsou\anaconda3\lib\site-packages\IPython\core\interactiveshell.py:3357: DtypeWarning: Columns (14) have mixed types.Specify dtype option on import or set low_memory=False.
  if (await self.run_code(code, result,  async_=asy)):
C:\Users\clemsou\anaconda3\lib\site-packages\IPython\core\interactiveshell.py:3357: DtypeWarning: Columns (2) have mixed types.Specify dtype option on import or set low_memory=False.
  if (await self.run_code(code, result,  async_=asy)):

In [3]:

df_users['grav'].describe()

count    1.876005e+06
mean     3.143937e+00
std      8.394679e-01
min      1.000000e+00
25%      3.000000e+00
50%      3.000000e+00
75%      4.000000e+00
max      4.000000e+00
Name: grav, dtype: float64

In [4]:
df_users.drop(inplace=True, labels=["place", "trip", "locp", "actp", "etatp", "num_veh", "secu"], axis=1)
df_users = df_users.groupby(['Num_Acc'], as_index=False).first() #keeping only the first gave me worst result

In [5]:
df_users.dropna(inplace=True)

In [6]:
df_places = acq.get_places()
df_places.drop(inplace=True, labels=["voie", "v1", "v2", "pr", "pr1", "vosp", "plan", "lartpc", "larrout", "situ", "env1"],axis=1)

In [7]:
df_places.isna().sum()

Num_Acc       0
catr          1
circ        798
nbv        1790
prof       1061
surf       1017
infra      1278
dtype: int64

In [8]:
df_places.dropna(inplace=True)

In [9]:
df_places.circ.unique() #0 should not exist - question from the dataset on kaggle

array([2., 1., 0., 3., 4.])

In [10]:
df_places["circ"] = df_places["circ"].astype(np.int64)
df_places.circ.describe()

count    837362.000000
mean          1.854929
std           0.720794
min           0.000000
25%           2.000000
50%           2.000000
75%           2.000000
max           4.000000
Name: circ, dtype: float64

In [11]:
df_places = df_places[df_places.circ != 0]

In [12]:
df_places.circ.describe()

count    792909.000000
mean          1.958922
std           0.587330
min           1.000000
25%           2.000000
50%           2.000000
75%           2.000000
max           4.000000
Name: circ, dtype: float64

In [13]:
df_places.isna().sum()

Num_Acc    0
catr       0
circ       0
nbv        0
prof       0
surf       0
infra      0
dtype: int64

In [14]:
df_places.head(5)

        Num_Acc  catr  circ  nbv  prof  surf  infra
0  201600000001   3.0     2  0.0   1.0   1.0    0.0
1  201600000002   3.0     1  0.0   1.0   1.0    0.0
2  201600000003   3.0     2  2.0   1.0   2.0    0.0
3  201600000004   4.0     2  0.0   1.0   1.0    0.0
5  201600000006   3.0     2  0.0   1.0   1.0    0.0

In [15]:
df_carac = acq.get_accident_caracteristics()
df_carac.drop(inplace=True, labels=["an",
                                    "col",
                                    "com",
                                    "adr",
                                    "gps",
                                    "lat",
                                    "long"],axis=1)

In [16]:
df_carac.isna().sum()

Num_Acc     0
mois        0
jour        0
hrmn        0
lum         0
agg         0
int         0
atm        21
dep         0
dtype: int64

In [17]:
df_carac.dropna(inplace=True)

In [18]:
df_carac.isna().sum()

Num_Acc    0
mois       0
jour       0
hrmn       0
lum        0
agg        0
int        0
atm        0
dep        0
dtype: int64

In [19]:
df_carac.head(5)

        Num_Acc  mois  jour  hrmn  lum  agg  int  atm  dep
1  201600000002     3    16  1800    1    2    6  1.0  590
2  201600000003     7    13  1900    1    1    1  1.0  590
3  201600000004     8    15  1930    2    2    1  7.0  590
4  201600000005    12    23  1100    1    2    3  1.0  590
5  201600000006    12    23  1115    1    2    1  7.0  590

In [20]:
df_carac['mn'] = df_carac['hrmn'].astype(str).str[-2:]
df_carac['hr'] = df_carac['hrmn'].astype(str).str[:-2]
df_carac.drop(columns='hrmn',inplace=True)

In [21]:
df_carac.head(5)

        Num_Acc  mois  jour  lum  agg  int  atm  dep  mn  hr
1  201600000002     3    16    1    2    6  1.0  590  00  18
2  201600000003     7    13    1    1    1  1.0  590  00  19
3  201600000004     8    15    2    2    1  7.0  590  30  19
4  201600000005    12    23    1    2    3  1.0  590  00  11
5  201600000006    12    23    1    2    1  7.0  590  15  11

In [22]:
df_carac['hr'].unique()

array(['18', '19', '11', '10', '8', '16', '12', '7', '20', '15', '9', '5',
       '13', '17', '21', '3', '6', '14', '22', '2', '1', '4', '23', ''],
      dtype=object)

In [23]:
df_carac['hr'].replace(inplace=True, to_replace='', value='0')

In [24]:
df_carac['hr'].unique()

array(['18', '19', '11', '10', '8', '16', '12', '7', '20', '15', '9', '5',
       '13', '17', '21', '3', '6', '14', '22', '2', '1', '4', '23', '0'],
      dtype=object)

In [25]:
df_users.dtypes

Num_Acc      int64
catu         int64
grav         int64
sex          int64
an_nais    float64
dtype: object

In [26]:
df_users.an_nais = df_users.an_nais.astype((np.int64))

In [27]:
df_users.dtypes

Num_Acc    int64
catu       int64
grav       int64
sex        int64
an_nais    int64
dtype: object

In [28]:
df_carac.dtypes

Num_Acc      int64
mois         int64
jour         int64
lum          int64
agg          int64
int          int64
atm        float64
dep          int64
mn          object
hr          object
dtype: object

In [29]:
df_carac[['atm', 'mn', 'hr']] = df_carac[['atm', 'mn', 'hr']].astype((np.int64))

In [30]:
df_carac.dtypes

Num_Acc    int64
mois       int64
jour       int64
lum        int64
agg        int64
int        int64
atm        int64
dep        int64
mn         int64
hr         int64
dtype: object

In [31]:
df_places.dtypes

Num_Acc      int64
catr       float64
circ         int64
nbv        float64
prof       float64
surf       float64
infra      float64
dtype: object

In [32]:
df_places.columns

Index(['Num_Acc', 'catr', 'circ', 'nbv', 'prof', 'surf', 'infra'], dtype='object')

In [33]:
df_places[df_places.columns] = df_places[df_places.columns].astype((np.int64))

In [34]:
df_places.dtypes

Num_Acc    int64
catr       int64
circ       int64
nbv        int64
prof       int64
surf       int64
infra      int64
dtype: object

In [35]:
df_users.head(15)

         Num_Acc  catu  grav  sex  an_nais
0   200500000001     1     3    1     1976
1   200500000002     1     4    1     1955
2   200500000003     1     4    1     1983
3   200500000004     1     2    1     1920
4   200500000005     1     2    1     1949
5   200500000006     1     1    2     1951
6   200500000007     1     3    1     1983
7   200500000008     1     2    1     1978
8   200500000009     1     3    1     1966
9   200500000010     1     4    1     1950
10  200500000011     1     4    1     1972
11  200500000012     1     3    1     1986
12  200500000013     1     3    2     1971
13  200500000014     1     4    1     1985
14  200500000015     3     2    2     1938

In [36]:
df_carac.head(15)

         Num_Acc  mois  jour  lum  agg  int  atm  dep  mn  hr
1   201600000002     3    16    1    2    6    1  590   0  18
2   201600000003     7    13    1    1    1    1  590   0  19
3   201600000004     8    15    2    2    1    7  590  30  19
4   201600000005    12    23    1    2    3    1  590   0  11
5   201600000006    12    23    1    2    1    7  590  15  11
6   201600000007     5     1    1    2    1    7  590  45  11
7   201600000008     5    14    2    1    1    1  590  15  19
8   201600000009     9    23    1    2    1    1  590   0  19
9   201600000010    12    30    1    1    1    9  590  30  10
10  201600000011     1    25    2    2    1    8  590   0   8
11  201600000012     1    28    3    1    1    1  590  15  18
12  201600000013     2     5    1    2    1    1  590   0  16
13  201600000014     4    17    1    2    1    1  590  30  12
14  201600000015     8    17    1    1    6    7  590  30  19
15  201600000016     9     8    1    1    1    1  590  15   8

In [37]:
print(len(df_users.Num_Acc.unique().tolist()))
print(df_users.shape[0])

839509
839509

In [38]:
print(len(df_places.Num_Acc.unique().tolist()))
print(df_places.shape[0])

792909
792909

In [39]:
print(len(df_carac.Num_Acc.unique().tolist()))
print(df_carac.shape[0])

362445
362445

In [40]:
df_users = df_users.reset_index(drop=True)
df_carac = df_carac.reset_index(drop=True)
df_places = df_places.reset_index(drop=True)
df_x_y = df_carac.merge(df_places, on="Num_Acc")
df_x_y = df_x_y.merge(df_users, on="Num_Acc")

In [41]:
df_x_y.head(15)

,Num_Acc,mois,jour,lum,agg,int,atm,dep,mn,hr,catr,circ,nbv,prof,surf,infra,catu,grav,sex,an_nais
0,201600000002,3,16,1,2,6,1,590,0,18,3,1,0,1,1,0,1,2,1,1960
1,201600000003,7,13,1,1,1,1,590,0,19,3,2,2,1,2,0,1,4,1,1997
2,201600000004,8,15,2,2,1,7,590,30,19,4,2,0,1,1,0,1,2,1,1999
3,201600000006,12,23,1,2,1,7,590,15,11,3,2,0,1,1,0,1,4,1,1957
4,201600000007,5,1,1,2,1,7,590,45,11,3,2,0,1,1,0,1,4,1,2001
5,201600000008,5,14,2,1,1,1,590,15,19,3,2,2,1,1,0,1,4,2,1969
6,201600000009,9,23,1,2,1,1,590,0,19,4,2,2,1,1,0,1,4,1,1984
7,201600000010,12,30,1,1,1,9,590,30,10,4,2,0,0,7,0,1,4,1,1973
8,201600000011,1,25,2,2,1,8,590,0,8,3,2,2,1,2,0,1,4,1,1966
9,201600000012,1,28,3,1,1,1,590,15,18,3,2,2,0,1,0,1,2,1,1990
10,201600000013,2,5,1,2,1,1,590,0,16,3,2,0,0,0,0,1,4,2,1947
11,201600000014,4,17,1,2,1,1,590,30,12,3,2,2,0,1,0,1,1,1,1996
12,201600000015,8,17,1,1,6,7,590,30,19,3,1,1,1,1,5,1,2,1,1970
13,201600000016,9,8,1,1,1,1,590,15,8,4,2,2,1,1,0,1,4,2,1978
14,201600000017,11,8,3,1,1,8,590,15,7,3,2,0,1,6,0,1,2,2,1996

In [42]:
df_x_y.shape[0]

340687

In [43]:
df_x_y.isna().sum()

Num_Acc    0
mois       0
jour       0
lum        0
agg        0
int        0
atm        0
dep        0
mn         0
hr         0
catr       0
circ       0
nbv        0
prof       0
surf       0
infra      0
catu       0
grav       0
sex        0
an_nais    0
dtype: int64

In [44]:
df_x_y.dropna(inplace=True)

In [45]:
df_x_y.drop('Num_Acc', axis=1,inplace=True)

In [46]:
from sklearn.model_selection import train_test_split
from sklearn.preprocessing import StandardScaler
from sklearn.metrics import classification_report
from sklearn.linear_model import LogisticRegression
from sklearn.model_selection import RepeatedStratifiedKFold, StratifiedKFold
from sklearn.metrics import accuracy_score, confusion_matrix, roc_curve, roc_auc_score, precision_score, recall_score, precision_recall_curve, f1_score
from sklearn.utils import class_weight
from sklearn.model_selection import cross_val_score

In [47]:
df_x_y.grav.value_counts() #stratifiedKfold

4    134857
2    105374
3     79834
1     20622
Name: grav, dtype: int64

In [48]:
cv = RepeatedStratifiedKFold()
#cross_val_score(KNeighborsClassifier(), X=df_x_y.drop('grav', axis=1), y=df_x_y['grav'], cv=cv)
X = df_x_y.drop('grav', axis=1)
X = X.drop(["catu", "an_nais", "sex", "infra"], axis=1)
y = df_x_y['grav']

In [49]:
# training-testing validating
X_train, X_rem, y_train, y_rem = train_test_split(
    X, y, train_size=0.4, stratify=y)
X_val, X_test, y_val, y_test = train_test_split(
    X_rem, y_rem, test_size=0.5, stratify=y_rem)

In [50]:
class_weights = class_weight.compute_class_weight(class_weight='balanced',
                                                  classes=np.unique(y_train),
                                                  y=y_train)

class_weights = dict(zip(range(1, len(class_weights) + 1), class_weights))

In [51]:
scaler = StandardScaler()
scaler.fit(X_train)
X_train = scaler.transform(X_train)
X_test = scaler.transform(X_test)
X_val = scaler.transform(X_val)

In [52]:

model = LogisticRegression(
    max_iter=1000, class_weight=class_weights, penalty='l2', solver='liblinear')
#grid = GridSearchCV(model, hyperparam_grid, cv=cv, scoring='f1')
#cv_model = cross_val_score(model,X,y,cv=cv, scoring='f1_micro')
#grid.fit(X_train, y_train)
#print(grid.best_score_)
#print(grid.best_params_)
#print(cv_model)
model.fit(X_train, y_train)

LogisticRegression(class_weight={1: 4.130015759485998, 2: 0.8082872666018174,
                                 3: 1.06687439326089, 4: 0.6315647998813563},
                   max_iter=1000, solver='liblinear')

In [53]:
y_pred = model.predict(X_test)
score = f1_score(y_test, y_pred, average='micro')
print('f1_score :', score)

f1_score : 0.44014597825980606

In [54]:
print(classification_report(y_test, y_pred))

              precision    recall  f1-score   support

           1       0.14      0.12      0.13      6186
           2       0.41      0.59      0.49     31613
           3       0.33      0.07      0.11     23951
           4       0.51      0.59      0.55     40457

    accuracy                           0.44    102207
   macro avg       0.35      0.34      0.32    102207
weighted avg       0.42      0.44      0.40    102207

In [55]:
# from sklearn.feature_selection import RFE
# predictors = X_train
# selector = RFE(model, n_features_to_select=1)
# selector = selector.fit(predictors, y_train)

In [56]:
# order = selector.ranking_
# feature_ranks = []
# for i in order:
#     feature_ranks.append(f"{i-1}. {X.columns[i-1]}")
# feature_ranks

In [57]:
#validation
y_pred = model.predict(X_val)
score = f1_score(y_val, y_pred, average='micro')
print(classification_report(y_val, y_pred))
print('f1_score :', score)

              precision    recall  f1-score   support

           1       0.12      0.11      0.12      6187
           2       0.42      0.59      0.49     31612
           3       0.32      0.07      0.11     23950
           4       0.51      0.59      0.55     40457

    accuracy                           0.44    102206
   macro avg       0.34      0.34      0.32    102206
weighted avg       0.42      0.44      0.40    102206

f1_score : 0.44018942136469486

In [58]:
import pickle
filename = 'trained_linear.sav'
with open(filename, 'wb') as file:
    pickle.dump(model, file)

In [59]:
X

,mois,jour,lum,agg,int,atm,dep,mn,hr,catr,circ,nbv,prof,surf
0,3,16,1,2,6,1,590,0,18,3,1,0,1,1
1,7,13,1,1,1,1,590,0,19,3,2,2,1,2
2,8,15,2,2,1,7,590,30,19,4,2,0,1,1
3,12,23,1,2,1,7,590,15,11,3,2,0,1,1
4,5,1,1,2,1,7,590,45,11,3,2,0,1,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
340682,12,7,1,1,3,1,971,0,17,2,2,2,3,1
340683,12,6,1,2,1,1,973,0,17,4,2,2,1,1
340684,12,19,1,1,1,1,973,10,14,2,2,2,0,1
340685,12,22,2,2,1,1,974,15,19,3,1,0,0,1
340686,12,10,2,2,1,1,974,0,19,3,2,0,4,1